rocksdb/aep/workloadf.log
/home/hustzyw/jdk1.8.0_191/bin/java -cp /home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/rocksdb-binding/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/conf:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/core-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/htrace-core4-4.1.0-incubating.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-mapper-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jackson-core-asl-1.9.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/HdrHistogram-2.1.4.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/jcip-annotations-1.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-api-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/slf4j-simple-1.7.25.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/rocksdb-binding-0.15.0.jar:/home/hustzyw/xiaohu/ycsb-rocksdb-binding-0.15.0/lib/fb-rocksdbjni-5.18.0.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadf -p rocksdb.dir=/pmem/ycsb-rocksdb-xiaohu -t
Command line: -db com.yahoo.ycsb.db.rocksdb.RocksDBClient -s -P our-nvm-workloads/workloadf -p rocksdb.dir=/pmem/ycsb-rocksdb-xiaohu -t
YCSB Client 0.15.0

Loading workload...
Starting test.
[Thread-3] INFO com.yahoo.ycsb.db.rocksdb.RocksDBClient - RocksDB data dir: /pmem/ycsb-rocksdb-xiaohu
2018-12-30 08:08:25:814 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-30 08:08:35:746 10 sec: 401380 operations; 40133.99 current ops/sec; est completion in 4 minutes [READ: Count=401559, Max=18943, Min=0, Avg=14.23, 90=31, 99=57, 99.9=115, 99.99=185] [READ-MODIFY-WRITE: Count=200891, Max=118783, Min=7, Avg=29.06, 90=48, 99=79, 99.9=149, 99.99=254] [UPDATE: Count=201019, Max=118783, Min=5, Avg=13.84, 90=17, 99=25, 99.9=38, 99.99=98] 
2018-12-30 08:08:45:749 20 sec: 885932 operations; 48440.67 current ops/sec; est completion in 3 minutes [READ: Count=484422, Max=53567, Min=0, Avg=12.8, 90=29, 99=36, 99.9=42, 99.99=58] [READ-MODIFY-WRITE: Count=242529, Max=54591, Min=7, Avg=26.33, 90=46, 99=56, 99.9=65, 99.99=102] [UPDATE: Count=242477, Max=8687, Min=5, Avg=12.43, 90=17, 99=23, 99.9=29, 99.99=46] 
2018-12-30 08:08:55:754 30 sec: 1397732 operations; 51154.42 current ops/sec; est completion in 3 minutes [READ: Count=511782, Max=1383, Min=0, Avg=12.04, 90=28, 99=34, 99.9=38, 99.99=45] [READ-MODIFY-WRITE: Count=255592, Max=9927, Min=7, Avg=24.99, 90=44, 99=53, 99.9=59, 99.99=77] [UPDATE: Count=255565, Max=9351, Min=5, Avg=11.94, 90=16, 99=22, 99.9=27, 99.99=33] 
2018-12-30 08:09:05:749 40 sec: 1877364 operations; 47987.19 current ops/sec; est completion in 2 minutes [READ: Count=479629, Max=24415, Min=0, Avg=12.89, 90=30, 99=36, 99.9=40, 99.99=51] [READ-MODIFY-WRITE: Count=239079, Max=24975, Min=7, Avg=26.63, 90=48, 99=56, 99.9=63, 99.99=86] [UPDATE: Count=239083, Max=1023, Min=5, Avg=12.68, 90=18, 99=24, 99.9=28, 99.99=35] 
2018-12-30 08:09:15:748 50 sec: 2358292 operations; 48107.23 current ops/sec; est completion in 2 minutes [READ: Count=481008, Max=3129, Min=1, Avg=12.98, 90=30, 99=37, 99.9=52, 99.99=81] [READ-MODIFY-WRITE: Count=241056, Max=46239, Min=7, Avg=26.47, 90=48, 99=57, 99.9=73, 99.99=120] [UPDATE: Count=241064, Max=45439, Min=5, Avg=12.49, 90=17, 99=23, 99.9=28, 99.99=47] 
2018-12-30 08:09:25:749 60 sec: 2830973 operations; 47253.92 current ops/sec; est completion in 2 minutes [READ: Count=472616, Max=9007, Min=0, Avg=13.18, 90=31, 99=38, 99.9=42, 99.99=49] [READ-MODIFY-WRITE: Count=236266, Max=9487, Min=7, Avg=26.93, 90=49, 99=59, 99.9=65, 99.99=75] [UPDATE: Count=236285, Max=1396, Min=5, Avg=12.73, 90=18, 99=24, 99.9=29, 99.99=33] 
2018-12-30 08:09:35:754 70 sec: 3302965 operations; 47175.61 current ops/sec; est completion in 2 minutes [READ: Count=471992, Max=934, Min=0, Avg=13.54, 90=31, 99=44, 99.9=55, 99.99=66] [READ-MODIFY-WRITE: Count=236369, Max=2813, Min=6, Avg=26.79, 90=49, 99=64, 99.9=77, 99.99=91] [UPDATE: Count=236320, Max=2625, Min=5, Avg=12.24, 90=17, 99=23, 99.9=28, 99.99=36] 
2018-12-30 08:09:45:749 80 sec: 3829252 operations; 52649.76 current ops/sec; est completion in 2 minutes [READ: Count=526287, Max=7307, Min=0, Avg=11.36, 90=26, 99=35, 99.9=44, 99.99=54] [READ-MODIFY-WRITE: Count=262730, Max=7559, Min=7, Avg=24.45, 90=43, 99=55, 99.9=66, 99.99=82] [UPDATE: Count=262744, Max=2189, Min=5, Avg=12.09, 90=16, 99=23, 99.9=28, 99.99=35] 
2018-12-30 08:09:55:754 90 sec: 4401026 operations; 57148.83 current ops/sec; est completion in 1 minute [READ: Count=571791, Max=70, Min=0, Avg=10.17, 90=24, 99=28, 99.9=32, 99.99=40] [READ-MODIFY-WRITE: Count=286271, Max=20767, Min=7, Avg=22.71, 90=40, 99=47, 99.9=52, 99.99=60] [UPDATE: Count=286284, Max=20591, Min=5, Avg=11.53, 90=15, 99=21, 99.9=25, 99.99=30] 
2018-12-30 08:10:05:749 100 sec: 4980063 operations; 57938.46 current ops/sec; est completion in 1 minute [READ: Count=579015, Max=11247, Min=0, Avg=10.11, 90=24, 99=28, 99.9=32, 99.99=36] [READ-MODIFY-WRITE: Count=289568, Max=366, Min=7, Avg=22.34, 90=40, 99=46, 99.9=52, 99.99=57] [UPDATE: Count=289535, Max=338, Min=5, Avg=11.27, 90=15, 99=21, 99.9=25, 99.99=30] 
2018-12-30 08:10:15:754 110 sec: 5527473 operations; 54713.64 current ops/sec; est completion in 1 minute [READ: Count=547409, Max=1392, Min=0, Avg=10.74, 90=25, 99=30, 99.9=34, 99.99=52] [READ-MODIFY-WRITE: Count=274095, Max=128959, Min=7, Avg=23.74, 90=42, 99=49, 99.9=56, 99.99=100] [UPDATE: Count=274138, Max=128767, Min=5, Avg=12, 90=16, 99=22, 99.9=27, 99.99=46] 
2018-12-30 08:10:25:749 120 sec: 6076261 operations; 54906.25 current ops/sec; est completion in 1 minute [READ: Count=548773, Max=1045, Min=0, Avg=10.83, 90=26, 99=31, 99.9=34, 99.99=41] [READ-MODIFY-WRITE: Count=274564, Max=19695, Min=7, Avg=23.51, 90=42, 99=49, 99.9=55, 99.99=71] [UPDATE: Count=274543, Max=19487, Min=5, Avg=11.7, 90=16, 99=22, 99.9=26, 99.99=31] 
2018-12-30 08:10:35:751 130 sec: 6610233 operations; 53386.52 current ops/sec; est completion in 1 minute [READ: Count=534031, Max=9311, Min=0, Avg=11.32, 90=27, 99=32, 99.9=36, 99.99=43] [READ-MODIFY-WRITE: Count=267423, Max=9455, Min=7, Avg=24.07, 90=43, 99=50, 99.9=56, 99.99=64] [UPDATE: Count=267413, Max=293, Min=5, Avg=11.73, 90=16, 99=22, 99.9=26, 99.99=30] 
2018-12-30 08:10:45:746 140 sec: 7064056 operations; 45400.46 current ops/sec; est completion in 59 seconds [READ: Count=453770, Max=4703, Min=0, Avg=13.33, 90=31, 99=37, 99.9=40, 99.99=44] [READ-MODIFY-WRITE: Count=226808, Max=78, Min=7, Avg=28.38, 90=52, 99=59, 99.9=65, 99.99=69] [UPDATE: Count=226789, Max=48, Min=5, Avg=13.92, 90=20, 99=25, 99.9=30, 99.99=34] 
2018-12-30 08:10:55:754 150 sec: 7565533 operations; 50112.62 current ops/sec; est completion in 49 seconds [READ: Count=501473, Max=974, Min=1, Avg=12.06, 90=29, 99=33, 99.9=37, 99.99=40] [READ-MODIFY-WRITE: Count=250580, Max=121727, Min=7, Avg=25.76, 90=46, 99=53, 99.9=58, 99.99=62] [UPDATE: Count=250612, Max=121599, Min=5, Avg=12.66, 90=17, 99=23, 99.9=26, 99.99=29] 
2018-12-30 08:11:05:746 160 sec: 8083263 operations; 51809.27 current ops/sec; est completion in 38 seconds [READ: Count=517748, Max=15775, Min=0, Avg=11.94, 90=29, 99=35, 99.9=44, 99.99=81] [READ-MODIFY-WRITE: Count=258697, Max=3361, Min=6, Avg=24.62, 90=45, 99=53, 99.9=67, 99.99=132] [UPDATE: Count=258675, Max=3269, Min=5, Avg=11.69, 90=16, 99=22, 99.9=28, 99.99=48] 
2018-12-30 08:11:15:747 170 sec: 8576412 operations; 49314.9 current ops/sec; est completion in 29 seconds [READ: Count=493147, Max=2417, Min=0, Avg=12.67, 90=31, 99=37, 99.9=43, 99.99=53] [READ-MODIFY-WRITE: Count=246201, Max=14287, Min=7, Avg=25.8, 90=48, 99=56, 99.9=64, 99.99=76] [UPDATE: Count=246198, Max=13719, Min=5, Avg=12.13, 90=17, 99=23, 99.9=27, 99.99=31] 
2018-12-30 08:11:25:748 180 sec: 9060500 operations; 48403.96 current ops/sec; est completion in 19 seconds [READ: Count=484069, Max=17151, Min=1, Avg=12.9, 90=31, 99=37, 99.9=44, 99.99=56] [READ-MODIFY-WRITE: Count=241949, Max=1434, Min=7, Avg=26.22, 90=50, 99=57, 99.9=65, 99.99=83] [UPDATE: Count=241942, Max=87, Min=5, Avg=12.35, 90=18, 99=23, 99.9=28, 99.99=32] 
2018-12-30 08:11:35:750 190 sec: 9546141 operations; 48554.39 current ops/sec; est completion in 10 seconds [READ: Count=485658, Max=7967, Min=0, Avg=12.91, 90=32, 99=38, 99.9=49, 99.99=83] [READ-MODIFY-WRITE: Count=242541, Max=352, Min=7, Avg=26.11, 90=50, 99=58, 99.9=71, 99.99=137] [UPDATE: Count=242536, Max=319, Min=5, Avg=12.25, 90=17, 99=24, 99.9=29, 99.99=52] 
2018-12-30 08:11:45:141 199 sec: 10000000 operations; 48329.14 current ops/sec; [READ: Count=453821, Max=3545, Min=0, Avg=12.97, 90=31, 99=47, 99.9=57, 99.99=70] [READ-MODIFY-WRITE: Count=227058, Max=9303, Min=6, Avg=26.23, 90=49, 99=68, 99.9=81, 99.99=109] [CLEANUP: Count=1, Max=16991, Min=16976, Avg=16984, 90=16991, 99=16991, 99.9=16991, 99.99=16991] [UPDATE: Count=227045, Max=8887, Min=5, Avg=12.22, 90=17, 99=24, 99.9=31, 99.99=45] 
[OVERALL], RunTime(ms), 199396
[OVERALL], Throughput(ops/sec), 50151.45740135208
[TOTAL_GCS_PS_Scavenge], Count, 26
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 840
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.4212722421713575
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 26
[TOTAL_GC_TIME], Time(ms), 840
[TOTAL_GC_TIME_%], Time(%), 0.4212722421713575
[READ], Operations, 10000000
[READ], AverageLatency(us), 12.1558603
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 53567
[READ], 95thPercentileLatency(us), 32
[READ], 99thPercentileLatency(us), 37
[READ], Return=OK, 10000000
[READ-MODIFY-WRITE], Operations, 5000267
[READ-MODIFY-WRITE], AverageLatency(us), 25.416376765480724
[READ-MODIFY-WRITE], MinLatency(us), 6
[READ-MODIFY-WRITE], MaxLatency(us), 128959
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 50
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 57
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 16984.0
[CLEANUP], MinLatency(us), 16976
[CLEANUP], MaxLatency(us), 16991
[CLEANUP], 95thPercentileLatency(us), 16991
[CLEANUP], 99thPercentileLatency(us), 16991
[UPDATE], Operations, 5000267
[UPDATE], AverageLatency(us), 12.24810275131308
[UPDATE], MinLatency(us), 5
[UPDATE], MaxLatency(us), 128767
[UPDATE], 95thPercentileLatency(us), 18
[UPDATE], 99thPercentileLatency(us), 23
[UPDATE], Return=OK, 5000267
corrupted double-linked list